# SpotElevationLostEdgeReferences Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SpotElevationLostEdgeReferences Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Some Spot Dimensions lost their References. Those Spot Dimensions will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpotElevationLostEdgeReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevationLostEdgeReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpotElevationLostEdgeReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace